#include "c8051f020.h"
#include "intrins.h"
#include "delay.h"

/***********************************************************************************
* 函数名称：Delay_us;
*
* 函数功能描述：延时n微秒子函数;
*              
* 输入参数：延时时间（单位微秒）;
*
* 返回数据：none；
*
* 注意：    none;
************************************************************************************/

void Delay_us(unsigned int Times)
{
  unsigned int i;
	for (i=0; i<Times; i++)
	{
		_nop_();_nop_();_nop_();_nop_();
    _nop_();_nop_();_nop_();_nop_();
		_nop_();_nop_();_nop_();_nop_();
		_nop_();
	}
}

/***********************************************************************************
* 函数名称：Delay_ms;
*
* 函数功能描述：延时n毫秒子函数;
*              
* 输入参数：延时时间（单位毫秒）;
*
* 返回数据：none；
*
* 注意：    none;
************************************************************************************/

void Delay_ms(unsigned int Times) 
{
    unsigned char i;
	for (i=0; i<Times; i++)	
	{
	   Delay_us(250);
	   Delay_us(250);
	   Delay_us(250);
	   Delay_us(250);
	}
}

/*void Enable_Wdog() 
{      
	WDTCN=0xA5;                
}   */