/***********************************************************************
*    剑齿虎STM8开发板硬件连接
*    PA4/UART1_RXD          
*    PA5/UART1_TXD          
************************************************************************/
#ifndef _UART1_H //宏定义，定义文件名称
#define _UART1_H


/*---------------------------头文件引用--------------------------------------*/
#include "stm8s.h"


/*---------------------------函数声明--------------------------------------*/
void UART1_Congfiguration(void);//UART1 配置函数
void UART1_Send_Byte(u8 byte);//UART1发送数据函数
void UART1_Printf_Demo(void);

#endif//定义文件名称结束


/************************ 论坛地址 www.zxkjmcu.com ******************************/